#include <stdio.h>
#include <stdlib.h>
#include <string.h>

/*
* int arr[5] arr有5个元素，每个元素是整形
* int *parr[5] parr有5个元素，每个元素是int *类型
* int (*parr)[5] parr是一个数组指针，指向一个有五个元素的整型数组
* int (*parr3[10])[5] parr3是一个数组，数组中有10个元素，每个元素是一个数组指针，指向一个有五个元素的整型数组
*
* parr3 图解
* ---------------		--------------------------
* | int (*p)[5] |		| a0 | a1 | a2 | a3 | a5 | int
* ---------------		--------------------------
* ---------------		--------------------------
* | int (*p)[5] |		| a0 | a1 | a2 | a3 | a5 | int
* ---------------		--------------------------
* ---------------		--------------------------
* | int (*p)[5] |		| a0 | a1 | a2 | a3 | a5 | int
* ---------------		--------------------------
* ---------------		--------------------------
* | int (*p)[5] |		| a0 | a1 | a2 | a3 | a5 | int
* ---------------		--------------------------
* ---------------		--------------------------
* | int (*p)[5] |		| a0 | a1 | a2 | a3 | a5 | int
* ---------------		--------------------------
* ---------------		--------------------------
* | int (*p)[5] |		| a0 | a1 | a2 | a3 | a5 | int
* ---------------		--------------------------
* ---------------		--------------------------
* | int (*p)[5] |		| a0 | a1 | a2 | a3 | a5 | int
* ---------------		--------------------------
* ---------------		--------------------------
* | int (*p)[5] |		| a0 | a1 | a2 | a3 | a5 | int
* ---------------		--------------------------
* ---------------		--------------------------
* | int (*p)[5] |		| a0 | a1 | a2 | a3 | a5 | int
* ---------------		--------------------------
* ---------------		--------------------------
* | int (*p)[5] |		| a0 | a1 | a2 | a3 | a5 | int
* ---------------		--------------------------
*/


/*
//数组指针，本质是一个指针，指向的对象为数组 int (*ptr)[10]，表示的是指向一个有10个整形元素数组的指针；
int main(void)
{
	//数组指针，存放数组的地址；
	int arr[] = {1, 2, 3, 4, 5, 6};
	int (*ptr)[6] = &arr;
	for (int i = 0; i < 6; i++) {
		printf("%d ", *(*ptr + i));
	}
	putchar('\n');
	return 0;
}
*/


/*
int main(void)
{
	char *arr[4] = {"Hello World",
			"Hello China",
			"Hello England",
			"Hello America"};
	char *(*ptr)[4] = &arr; // ptr本质是一个指针，指向一个数组，数组中的每个元素类型为char *
	for (int i = 0; i < 4; i++) {
		printf("%s\n", *(*ptr + i));
	}
	return 0;
}
*/


void print_arr(int (*p)[5], int row, int list)
{
	for (int i = 0; i < row; i++) {
		for (int j = 0; j < list; j++) {
			// p+i 指向的二维数组的第i行, 也是此行整个数组的地址,
			// 对其解引用，自然获取的是整个数组，所以代表的是数组名
			printf("%d\t", *(*(p + i) + j));
		}
		putchar('\n');
	}
}

//二级指针做形参，传入的实参必须为指针数组
void print_arr_1(int **p, int row, int list)
{
	for (int i = 0; i < row; i++) {
		for (int j = 0; j < list; j++) {
			// p+i 指向的二维数组的第i行, 也是此行整个数组的地址,
			// 对其解引用，自然获取的是整个数组，所以代表的是数组名
			printf("%d\t", *(*(p + i) + j));
		}
		putchar('\n');
	}
}

void print_arr_2(int *p[], int row, int list)
{
	for (int i = 0; i < row; i++) {
		for (int j = 0; j < list; j++) {
			// p+i 指向的二维数组的第i行, 也是此行整个数组的地址,
			// 对其解引用，自然获取的是整个数组，所以代表的是数组名
			printf("%d\t", *(*(p + i) + j));
		}
		putchar('\n');
	}
}
int main(void)
{
	// 二维数组想象成一维数组，二维数组的数组名表示第一行元素的地址;
	int arr[3][5] = {{1, 2, 3, 4, 5},
			 {11, 12, 13, 14, 15},
			 {21, 22, 23, 24, 25},
	};
	int *p[3] = {arr[0], arr[1], arr[2]};
	print_arr(arr, 3, 5);
	print_arr_1(p, 3, 5);
	print_arr_2(p, 3, 5);
	return 0;
}

